# FieldValues Constructor (IList(ValueAtPoint)) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FieldValues Constructor (IList<(Of <(<'ValueAtPoint>)>)>)
FieldValues Class See Also
---
Creates object from an array of domain point values
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FieldValues(
	IList<ValueAtPoint> valueAtPoint
)
```

Visual Basic
---
```text
Public Sub New ( _
	valueAtPoint As IList(Of ValueAtPoint) _
)
```

Visual C++
---
```text
public:
FieldValues(
	IList<ValueAtPoint^>^ valueAtPoint
)
```

# ### Parameters
valueAtPoint
    Type: System.Collections.Generic..::..IList<(Of <(<'ValueAtPoint>)>)> Array of values, each corresponding to a domain point
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | valueAtPoint array contains members with different numbers of measurements |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FieldValues Class
FieldValues Overload
Autodesk.Revit.DB.Analysis Namespace